stress.yml
config:
    target: 'http://localhost:3000'
    phases:
        - duration: 10
          arrivalRate: 10
          rampTo: 1000
          name: 'Warm up the application'
        - duration: 60
          arrivalRate: 1000
          name: 'Sustained max load'
scenarios:
    - flow:
          - get:
                url: '/convert?from=BTC&to=EUR&amount=123.45'